# FabricationPartSizeMap Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap Class
Members See Also
---
This class represents the fabrication part size map for straights allowing the sizes to be changed from a user interface for multiple straights with diffent sizes.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public class FabricationPartSizeMap : IDisposable
```

Visual Basic
---
```text
Public Class FabricationPartSizeMap _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationPartSizeMap : IDisposable
```

# Remarks
This is used as the data container for the FabricationPartSizeMapSet typeDef for crs:Set or Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap for ISet so a list of sizes can be generated to allow the user to select a size and map it to another.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Fabrication..::..FabricationPartSizeMap
# See Also
FabricationPartSizeMap Members
Autodesk.Revit.DB.Fabrication Namespace